---
kind: method
id: M:Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData.GetUIDataItems
source: html/6caaf073-ed2d-0546-85fd-0c462787f79f.htm
---
# Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData.GetUIDataItems Method

Gets all UI data items stored in the UI data.

## Syntax (C#)
```csharp
public IList<PipeFittingAndAccessoryPressureDropUIDataItem> GetUIDataItems()
```

## Returns
An array of UI data items.